const base64 = [
	'A','B','C','D','E','F','G','H','I','J','K','L','M',
	'N','O','P','Q','R','S','T','U','V','W','X','Y','Z',
	'a','b','c','d','e','f','g','h','i','j','k','l','m',
	'n','o','p','q','r','s','t','u','v','w','x','y','z',
	'0','1','2','3','4','5','6','7','8','9','+','/', '='
]

const positive64 = [
	'富强','务实','文明','上进','坚强','创新','无私','勇敢','爱国','敬业','诚信','友善','朝气',
	'乐观','勤奋','好学','豁达','谦虚','自信','聪慧','正直','执着','积极','阳光','沉稳','感恩',
	'努力','沉着','开拓','果敢','宽容','贡献','奉献','奋斗','果断','自律','朴实','坚毅','热心',
	'严谨','进取','辛勤','求实','求真','勤学','踏实','勤俭','淡泊','梦想','包容','真诚','诚实',
	'虚心','自省','勤劳','忠诚','热爱','奋勇','专注','钻研','合作','友爱','团结','认真', '刻苦'
]

export const base2pos = (() => {
	const rt = {};
	for (let i = 0 ; i < base64.length ; i++) {
		rt[base64[i]] = positive64[i];
	}
	return rt;
})();

export const pos2base = (() => {
	const rt = {};
	for (let i = 0 ; i < base64.length ; i++) {
		rt[positive64[i]] = base64[i];
	}
	return rt;
})();